<style scoped lang="less">
	#protocol{
	 	position: fixed;
	    top: 64px;
	    left: 4%;
	    right: 4%;
	    bottom: 80px;
		background: #f9f7f2;
		z-index: 112;
	 	font-size: 16px;
		overflow: scroll;
		box-shadow: 0px 1px 2px #888888;
		border-radius: 6px;
		.protocol_warp{
			position: relative;
			padding: 10px .4rem 36px;
			h2{
				font-weight: bold;
			}
			h6{
				margin-top: 10px;
				margin-bottom: 6px;
				font-weight: 500;
			}
			p{
				font-size: 12px;
				text-align: justify;
	    		text-justify: inter-ideograph;
				text-indent: 2em;
				line-height: 20px;
			}
		}

		.bottom_action{
			display: flex;
			background: #fff;
			margin-top: 10px;
			position: fixed;
			bottom: 80px;
			width: 92%;

			button{
				flex: 1;
				padding: 8px 0;
				&.ignore{
					color:#888;
					position: relative;
					&:after{
						position: absolute;
						content: '';
						clear: both;
						right: 0;
						top: 0;
						bottom: 0;
						border-right: 1px solid #eee;
					}
				}
				&.accept{
					color:blue;
				}
			}
		}
	}
</style>

<template>
	<div class="protocol" id="protocol">
		<div class="protocol_warp">
			<h2>Glohelp 用户使用协议</h2>
			<h6>一、总则</h6>
			<p>1.1、Glohelp网络服务平台（以下简称“本平台”）依据中华人民共和国法律的相关规定制定本协议。本协议具有合同效力。用户注册时，请认真阅读本协议，并选择接受或不接受本协议</p>
			<p>1.2、 本平台包括其官网、APP、微信企业服务号等其官方公布的任一应用产品</p>
			<p>1.3、 用户注册本平台（包含第三方平台登录）即代表同意本协议的全部条款，本协议即在用户与本平台之间产生法律效力，对双方均具有法律约束力。</p>
			<p>1.4、 用户注册成功后（包含第三方平台登录），将会拥有独立账号，用户应当对其账号的意思表示承担相应的法律责任。</p>
			<p>1.5、本平台有权变更本协议，生效的协议内容以本平台公布的最新版本为准。本协议条款变更后，本平台将第一时间对用户进行提示，用户可选择接受或不接受修订后的协议。</p>
			<p>1.6、本协议内容包含本协议正文，以及本平台在运营过程中面向用户制定的所有使用规则，该规则与本协议正文具有同等法律效。</p>
			<h6>二、用户的权利和义务</h6>
			<p>2.1、 用户应遵守中华人民共和国及相关国家法律，不得利用本平台从事违反社会公德、公共利益或违法犯罪活动，包括但不限于种族歧视、色情传播、邪教、侵犯知识产权、诈骗、洗钱、走私、恐怖活动、颠覆国家政权等。用户如从事上述活动，须承担全部法律责任，本平台不承担任何直接或间接、连带责任。</p>
			<p>2.2、用户在使用本平台过程中，应当向本平台提供真实准确的注册信息，包括但不限于姓名（名称）、年龄、性别、国别、身份证、护照等自然人或法人信息，同时于相关信息变更时在本平台及时更新。</p>
			<p>2.3、用户有义务保证在本平台上发布的信息真实、准确、无误导性，且不侵害他人合法权益。</p>
			<p>2.4、用户在使用本平台过程中如与其他用户发生纠纷，可以通过反馈、举报、投诉等方式提请本平台处理，本平台会依据相关法律、本协议及本平台的其他规则进行处理。</p>
			<p>2.5、为了提升本平台的服务质量，除双方另有约定以外，本平台默认用户同意将其在本平台所上传、发布的内容的知识产权授权本平台使用，除非用户明示撤销上述部分或全部授权。</p>
			<p>2.6、 用户可自主选择是否接收本平台单方给用户推送的信息，包括但不限于求助信息、帮助信息、活动信息、交易信息、榜单信息等。</p>
			<h6>三、本平台的权利和义务</h6>
			<p>3.1、 本平台有义务持续提升技术水平，努力确保用户网上交流和互助活动的正常进行，尽力避免服务中断或将中断时间限制在最短时间内。</p>
			<p>3.2、 本平台对版面进行改版、服务系统升级、增加（或调整）服务功能等须中断服务的操作时，有权暂时中断服务。本平台将视具体情况在实施以上行为时予以公告</p>
			<p>3.3、 本平台有权对用户的注册和更新资料进行审查，对存在任何疑问或异议的资料，本平台有权发出通知问询用户，并要求其做出解释、更正。</p>
			<p>3.4、 对提供虚假资料进行注册或更新的用户，以及利用本平台从事违反社会公德、公共利益或违法犯罪活动的用户，本平台保留采取限制权限、封禁账号等处理措施的权利，并有权追究用户的法律责任。</p>
			<p>3.5、根据国家法律法规、本平台的相关规定和本平台所掌握的事实依据，如本平台认定用户存在违法违规或恶意损害其他用户利益等不当行为，本平台有权对该用户在平台内进行公示。</p>
			<p>3.6、本平台为第三方中立信息发布平台，对于用户所发布的求助或帮助等相关信息的合法性、真实性、有效性，以及用户履约能力等，本平台不提供保证或担保。</p>
			<h6>四、用户之间的权力和义务</h6>
			<p>4.1、 本平台用户，包括“帮助者”和“求助者”，分别指提供帮助和发布需求的用户。</p>
			<p>4.2、 用户使用本平台提供帮助和发布需求时，应了解且遵守以下事项：</p>
			<p>a) 帮助者和求助者应通过自己的审慎判断来确定帮助标的、帮助者和求助者信息的真实性、合法性以及准确性；帮助者和求助者中一方不当行为对另一方造成的损失，本平台不承担任何直接或间接、连带责任。</p>
			<p>b) 帮助者和求助者应秉持诚信、友善的精神自行协商解决由帮助或求助所引起的纠纷，本平台可参与调解，提供证据；协商或调解不成的，帮助者和求助者可诉诸法律途径加以解决，本平台将全力配合司法机关相关工作。</p>
			<p>c)帮助者和求助者应自行负担因帮助或求助行为产生的费用。</p>
			<p>4.3、帮助者的权利与义务</p>
			<p>4.3.1、帮助者接受求助者邀约后，帮助者有义务就求助者的问题、帮助所涉及事项进行提前沟通解答，促成帮助事项顺利推进。</p>
			<p>4.3.2、帮助者和求助者确认帮助事项、达成帮助共识后，若符合合同的成立与生效要件，任何一方不得单方违约。合同履行过程中，双方均有权依照相关法律规定追究过错方法律责任、维护己方合法权益。</p>
			<p>4.4、求助者的权利与义务</p>
			<p>4.4.1、求助者发布的需求信息应当真实、准确、合法，并有义务就拟帮助者的问题、帮助所涉及事项进行提前沟通解答，促成求助事项顺利推进。</p>
			<p>4.4.2、求助者发布需求后，即代表授权本平台向帮助者披露必要信息并同意接受本平台提供的撮合服务。</p>
			<p>4.4.3 为更好地满足求助者的需求，提高供需双方信息匹配效率，本平台会在需求有效期内为求助者发布的需求进行推送，帮助者可自主选择是否接受该推送。</p>
			<h6>五、知识产权</h6>
			<p>5.1、 用户在本平台发表的文字、图片、视频等所有信息，除署名权、发表权、修改权外的其他知识产权，均独家排他无偿许可给本平台，并授权本平台为维护上述知识产权采取相应法律措施。本协议已经构成《中华人民共和国著作权法》第二十五条所规定的书面协议，其效力及于用户在本平台发布的任何受著作权法保护的作品内容，无论该内容形成于本协议签订前还是本协议签订后。用户可联系我们，明示撤销上述部分或全部授权。</p>
			<h6>六、通知和公告</h6>
			<p>6.1、 本平台不定期通过平台页面公告或应用推送或手机短信等方式，向用户发送通知或公告，所有通知或公告自发送到达时起生效。</p>
			<h6>七、不可抗力</h6>
			<p>7.1、 因不可抗力或者其他意外事件，使得本协议的履行不可能、不必要或者无意义的，双方均不承担责任。本合同所称之不可抗力意指不能预见、不能避免并不能克服的客观情况，包含但不限于互联网络连接故障，电脑、通讯或其他系统的故障，电力故障，罢工，暴乱，骚乱，灾难性天气(如火灾、洪水、风暴等)，爆炸，战争，政府行为或任何其它自然或人为造成的灾难等客观情况。</p>
			<h6>八、免责声明</h6>
			<p>8.1、 如出现下列情况本平台无需承担任何责任：</p>
			<p>8.1.1、用户自行将账号、密码告知他人或与他人共享注册账户，由此导致的信息泄露或其他非平台原因导致的信息泄漏。</p>
			<p>8.1.2、 由于黑客攻击、计算机病毒侵入或发生因政府管制而造成的暂时性关闭等，从而影响网络正常运行及非平台原因而造成的个人信息泄露、丢失、被盗用或被篡改等。</p>
			<p>8.1.3、本平台在本协议中列明的其他所有免责情形的。</p>
			<h6>九、平台保密安全</h6>
			<p>9.1、 本平台高度重视用户信息保护工作，用户接受本协议时，应明确了解并同意如下内容：</p>
			<p>9.1.1、 本平台有权在平台范围内使用客户的相关信息。</p>
			<p>9.1.2、 本平台不会向任何第三方出售或出借用户的个人或法人信息，除非事先得到用户许可。</p>
			<p>9.1.3、 严禁任何用户通过本平台侵犯其他用户信息，本平台也不允许用户通过第三方以任何手段收集、编辑、出售或者无偿传播用户的个人或法人信息。</p>
			<p>9.2、 用户在本平台上的个人或法人信息将在下述情况下可能部分或全部被披露：</p>
			<p>9.2.1、 经用户同意，向第三方披露。</p>
			<p>9.2.2、根据法律的有关规定，应行政、司法等国家机关的要求，向他方披露。</p>
			<p>9.2.3、 为提供本平台用户所要求的帮助或求助信息，而必须和第三方分享用户的个人或法人信息。</p>
			<p>9.2.4、 其它本平台根据法律规定必需的披露</p>
			<h6>十、纠纷解决方式</h6>
			<p>10.1、 本协议及其规则的有效性、履行和与本协议及其规则效力有关的所有事宜，将受中华人民共和国法律管辖，任何争议解决仅适用中华人民共和国法律。</p>

		</div>
		<div class="bottom_action">

			<button type="button" name="button" class="ignore">忽略</button>
			<button type="button" name="button" class="accept">接受</button>
		</div>
	</div>
</template>

<script>
export default {
  data() {
    return {};
  },
  props: {

  },
  methods: {},
  created() {}
};
</script>
